# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Soft fork of the helix editor
brew "evil-helix"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line tools for fly.io services
brew "flyctl"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# General purpose AT Protocol CLI in Go
brew "goat"
# Improved top (interactive process viewer)
brew "htop"
# Git-compatible distributed version control system
brew "jj"
# Julia installer and version multiplexer
brew "juliaup"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Fast Cross-Platform Package Manager
brew "micromamba"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# AI coding agent, built for the terminal
brew "opencode"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Rust toolchain installer
brew "rustup"
# Sequoia-PGP command-line tool
brew "sequoia-sq"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig@0.15"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Free and open-source web browser
cask "chromium"
# Web browser
cask "firefox"
cask "font-eb-garamond"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-inconsolata"
cask "font-lora"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Tools to protect your emails and files
cask "gpg-suite"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Save articles to read, highlight key content, and organise notes for review
cask "reader"
# Instant messaging application focusing on security
cask "signal"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
# Collect, organise, cite, and share research sources
cask "zotero"
cargo "acdc-cli"
cargo "acdx"
cargo "bacon"
cargo "btop"
cargo "cargo-about"
cargo "cargo-binstall"
cargo "cargo-deny"
cargo "cargo-diet"
cargo "cargo-generate"
cargo "cargo-nextest"
cargo "cargo-semver-checks"
cargo "cargo-zigbuild"
cargo "committed"
cargo "coreutils"
cargo "du-dust"
cargo "eza"
cargo "fd-find"
cargo "git-absorb"
cargo "git-delta"
cargo "git-forge"
cargo "git-metadata"
cargo "git-stack"
cargo "git-template"
cargo "git-vendor"
cargo "hyperfine"
cargo "just"
cargo "mprocs"
cargo "ripgrep"
cargo "rumdl"
cargo "rusty-man"
cargo "sccache"
cargo "speedtest-rs"
cargo "starship"
cargo "tokei"
cargo "tracey"
cargo "tree-sitter-cli"
cargo "typos-cli"
cargo "typos-lsp"
cargo "wasm-pack"
cargo "zellij"
uv "ipython"
uv "maturin", with: ["maturin-import-hook"]
uv "mypy"
uv "pre-commit"
uv "prek"
uv "pytest"
uv "rich-cli"
uv "ruff"
uv "rumdl"
uv "ty"
uv "typos"
npm "release-please"
npm "sequoia-cli"
